Если номер в поле "SIP" - неизвестен, звонок входящий, известен - звонок исходящий либо внутренний.
Известный номер - это внутренний номер типа 100, или номер на который устаовленна переадресация, на скринах везде это мой номер 79271028738.
Смотрим куда звонили, если номер неизвестный - значит звонок исходящий, если номер известный - звонок внутренний. Если запись многострочная - ищем строчку с Incoming определяем её статус - если неотвечен, значит звонок неотвеченый, если разговор - находим вторую строку со статусом разговор и и берём из неё номер ответа.
